app/controllers/api/feed_source_items_controller.rb

SELECT "feed_source_items".* FROM "feed_source_items"
---
  def index
    @feed_source_items = FeedSourceItem.all

INSERT INTO "feed_source_items" ("feed_id", "source_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["feed_id", 1], ["source_id", 4], ["created_at", "2019-03-06 11:00:58.985188"], ["updated_at", "2019-03-06 11:00:58.985188"]]
---
  def create
    @feed_source_item = FeedSourceItem.new(feed_source_item_params)
    if @feed_source_item.save