app/controllers/api/feeds_controller.rb

INSERT INTO "feeds" ("feed_title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["feed_title", "vishal eat a dick"], ["user_id", 14], ["created_at", "2019-03-02 02:30:08.952276"], ["updated_at", "2019-03-02 02:30:08.952276"]]
---
  def create
    @feed = Feed.new(feed_params)
    @feed.user_id = current_user.id
    if @feed.save

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @feed = Feed.find(params[:id])