app/controllers/api/sources_controller.rb

SELECT "sources".* FROM "sources"
---
    def index
      @sources = Source.all

SELECT  "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @source = Source.find(params[:id])