app/views/api/sources/show.json.jbuilder

SELECT "articles".* FROM "articles" WHERE "articles"."source_id" = $1  [["source_id", 1]]
---

@source.articles.includes(:source).each do |article|