app/views/api/feeds/show.json.jbuilder

SELECT "articles".* FROM "articles" INNER JOIN "sources" ON "articles"."source_id" = "sources"."id" INNER JOIN "feed_source_items" ON "sources"."id" = "feed_source_items"."source_id" WHERE "feed_source_items"."feed_id" = $1  [["feed_id", 1]]
---

@feed.articles.each do |article|