app/models/user.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "x28BJKArPxL4pI82sWSDWw"], ["updated_at", "2019-02-26 22:29:15.429669"], ["id", 2]]
---
	def reset_session_token!
		self.session_token = User.generate_session_token
		self.save!